"""Утилиты.

TODO
- cli калькулятор для финансов
    - работа только с целыми числами для сохранения точности расчета
    - принимаемые и возвращаемые значения - в диапазоне [-2**31; 2**31-1]
    - арифметические операции
    - операция расчета дохода по вкладу
    - требование N-1
    - требование N

- поиск события в логе
    - требование 1
    - требование 2
    - требование N

- утилита поиска учетных данных с истекающим сроком действия
    - требование 1
    - требование 2
    - требование N

"""
